# Clustering

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
df = pd.read_csv('affairs.csv', index_col=0)

In [5]:
df = pd.get_dummies(columns=['occupation'], data=df)

In [6]:
df.head()

,rate_marriage,age,yrs_married,children,religious,educ,affairs,occupation_1,occupation_2,occupation_3,occupation_4,occupation_5,occupation_6
0,3,32.0,9.0,3.0,3,17,0.111111,0,1,0,0,0,0
1,3,27.0,13.0,3.0,1,14,3.230769,0,0,1,0,0,0
2,4,22.0,2.5,0.0,1,16,1.400000,0,0,1,0,0,0
3,4,37.0,16.5,4.0,3,16,0.727273,0,0,0,0,1,0
4,5,27.0,9.0,1.0,1,14,4.666666,0,0,1,0,0,0

In [7]:
df

,rate_marriage,age,yrs_married,children,religious,educ,affairs,occupation_1,occupation_2,occupation_3,occupation_4,occupation_5,occupation_6
0,3,32.0,9.0,3.0,3,17,0.111111,0,1,0,0,0,0
1,3,27.0,13.0,3.0,1,14,3.230769,0,0,1,0,0,0
2,4,22.0,2.5,0.0,1,16,1.400000,0,0,1,0,0,0
3,4,37.0,16.5,4.0,3,16,0.727273,0,0,0,0,1,0
4,5,27.0,9.0,1.0,1,14,4.666666,0,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6361,5,32.0,13.0,2.0,3,17,0.000000,0,0,0,1,0,0
6362,4,32.0,13.0,1.0,1,16,0.000000,0,0,0,0,1,0
6363,5,22.0,2.5,0.0,2,14,0.000000,0,0,1,0,0,0
6364,5,32.0,6.0,1.0,3,14,0.000000,0,0,1,0,0,0
6365,4,22.0,2.5,0.0,2,16,0.000000,0,1,0,0,0,0

Use KMeans to find 3 clusters

In [8]:
from sklearn.cluster import KMeans

In [10]:
clu = KMeans(n_clusters = 3, random_state = 0)

In [11]:
clu.fit(df)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=3, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=0, tol=0.0001, verbose=0)

In [12]:
clu.labels_

array([2, 2, 0, ..., 0, 2, 0])

In [13]:
df2 = df.copy()

In [14]:
df2['cluster'] = clu.labels_

In [16]:
df2.groupby('cluster').mean()

,rate_marriage,age,yrs_married,children,religious,educ,affairs,occupation_1,occupation_2,occupation_3,occupation_4,occupation_5,occupation_6
cluster,,,,,,,,,,,,,
0,4.215116,24.095785,3.358430,0.496366,2.330814,14.348547,0.876362,0.009012,0.127616,0.458140,0.288372,0.100581,0.016279
1,3.945343,39.979215,20.461124,3.060431,2.649731,13.883757,0.394723,0.003849,0.120862,0.444958,0.260200,0.153195,0.016936
2,4.017824,30.927474,11.814382,1.972649,2.449293,14.177013,0.591874,0.003073,0.161647,0.386601,0.309773,0.119852,0.019053

In [18]:
(df2.age - df2.age.min())/(df2.age.max() - df2.age.min()) # min-max

0       0.591837
1       0.387755
2       0.183673
3       0.795918
4       0.387755
          ...
6361    0.591837
6362    0.591837
6363    0.183673
6364    0.591837
6365    0.183673
Name: age, Length: 6366, dtype: float64

In [19]:
df_norm = df.copy()

In [21]:
df_norm = (df_norm - df_norm.mean())/df_norm.std() # standard normalization

In [23]:
clu.fit(df_norm)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=3, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=0, tol=0.0001, verbose=0)

In [24]:
df2 = df_norm.copy()

In [25]:
df2['cluster'] = clu.labels_

In [26]:
df2.groupby('cluster').mean()

,rate_marriage,age,yrs_married,children,religious,educ,affairs,occupation_1,occupation_2,occupation_3,occupation_4,occupation_5,occupation_6
cluster,,,,,,,,,,,,,
0,0.023699,-0.654340,-0.635244,-0.530857,-0.152783,-0.301907,0.111224,0.058528,0.137119,0.466136,-0.633791,0.064596,-0.126618
1,0.147376,-0.161992,-0.314742,-0.269816,0.016746,0.937314,-0.055457,-0.058224,-0.379265,-0.881250,1.417045,-0.338547,0.293951
2,-0.175092,1.193339,1.305264,1.097108,0.227781,-0.392533,-0.125503,-0.038978,0.135001,0.078666,-0.310892,0.212587,-0.072225

In [27]:
df2.groupby('cluster').size()

cluster
0    2877
1    1683
2    1806
dtype: int64

## Getting  summary information on the clusters' charateristics

### Finding the best clustering method

In [29]:
from sklearn import metrics
from sklearn.cluster import KMeans
from sklearn.cluster import Birch
from sklearn.cluster import AgglomerativeClustering

bestSil = -1
for k in range(2, 10):
    clus = [KMeans(n_clusters=k, n_jobs=-1), Birch(n_clusters=k), AgglomerativeClustering(n_clusters=k)]
    for cl in clus:
        res = cl.fit(df)
        sil = metrics.silhouette_score(df, res.labels_)
        print(str(cl)[:10] + ' with k =' + str(k) + ': ' + str(round(sil,4)))
        if (sil > bestSil):
            bestSil = sil
            bestCl = cl

KMeans(algwith k =2: 0.5651
Birch(branwith k =2: 0.5569
Agglomeratwith k =2: 0.5584
KMeans(algwith k =3: 0.4233
Birch(branwith k =3: 0.4748
Agglomeratwith k =3: 0.4781
KMeans(algwith k =4: 0.3749
Birch(branwith k =4: 0.3602
Agglomeratwith k =4: 0.3618
KMeans(algwith k =5: 0.383
Birch(branwith k =5: 0.3441
Agglomeratwith k =5: 0.3702
KMeans(algwith k =6: 0.361
Birch(branwith k =6: 0.3512
Agglomeratwith k =6: 0.3479
KMeans(algwith k =7: 0.346
Birch(branwith k =7: 0.3497
Agglomeratwith k =7: 0.3134
KMeans(algwith k =8: 0.354
Birch(branwith k =8: 0.3606
Agglomeratwith k =8: 0.3182
KMeans(algwith k =9: 0.3351
Birch(branwith k =9: 0.3414
Agglomeratwith k =9: 0.3305

In [30]:
bestCl

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=2, n_init=10, n_jobs=-1, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=0)

In [31]:
bestSil

0.5651278945170563

In [32]:
clu = KMeans(n_clusters = 2, random_state = 0)

In [33]:
clu.fit(df)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=2, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=0, tol=0.0001, verbose=0)

In [34]:
clu.labels_

array([0, 0, 0, ..., 0, 0, 0])

In [35]:
df2 = df.copy()

In [36]:
df2['cluster'] = clu.labels_

In [37]:
df2.groupby('cluster').mean()

,rate_marriage,age,yrs_married,children,religious,educ,affairs,occupation_1,occupation_2,occupation_3,occupation_4,occupation_5,occupation_6
cluster,,,,,,,,,,,,,
0,4.178945,24.998931,4.389734,0.70366,2.340779,14.343156,0.847707,0.008555,0.133080,0.446293,0.295865,0.098622,0.017586
1,3.974513,37.046339,18.017609,2.74861,2.592678,13.949954,0.427832,0.002317,0.138554,0.419370,0.272938,0.150602,0.016219